With the change in #509 things seem to work as expected, and I think the resource still gets replaced in all situations where that would be expected :

### Adding a new trust certificate with cert content unknown at plan time
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # lxd_trust_certificate.computed_cert_example will be created
  + resource "lxd_trust_certificate" "computed_cert_example" {
      + content     = (sensitive value)
      + fingerprint = (known after apply)
      + name        = "just-testing"
      + projects    = []
      + type        = "client"
    }

  # tls_private_key.client_key will be created
  + resource "tls_private_key" "client_key" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P384"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.client_cert will be created
  + resource "tls_self_signed_cert" "client_cert" {
      + allowed_uses          = [
          + "client_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "just-testing"
          + organization = "LXD"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tls_private_key.client_key: Creating...
tls_private_key.client_key: Creation complete after 0s [id=187bff4777f0aa3500a9f213ff745c13a4a9abe7]
tls_self_signed_cert.client_cert: Creating...
tls_self_signed_cert.client_cert: Creation complete after 0s [id=292612245301452014992727172605085142908]
lxd_trust_certificate.computed_cert_example: Creating...
lxd_trust_certificate.computed_cert_example: Creation complete after 0s [name=just-testing]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

### Switching the value of `Content` to a new, also computed unknown value
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # lxd_trust_certificate.computed_cert_example must be replaced
-/+ resource "lxd_trust_certificate" "computed_cert_example" {
      ~ content     = (sensitive value)
      ~ fingerprint = "1121b78ef216b434ca94ee3ef47ee62d69d8026fcc8855ee1c1c5519f5f56986" # forces replacement -> (known after apply) # forces replacement
        name        = "just-testing"
        # (2 unchanged attributes hidden)
    }

  # tls_self_signed_cert.client_cert_two will be created
  + resource "tls_self_signed_cert" "client_cert_two" {
      + allowed_uses          = [
          + "client_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "just-testing"
          + organization = "LXD"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

lxd_trust_certificate.computed_cert_example: Destroying... [name=just-testing]
lxd_trust_certificate.computed_cert_example: Destruction complete after 0s
tls_self_signed_cert.client_cert_two: Creating...
tls_self_signed_cert.client_cert_two: Creation complete after 0s [id=317181090428584490246863920778897570130]
lxd_trust_certificate.computed_cert_example: Creating...
lxd_trust_certificate.computed_cert_example: Creation complete after 0s [name=just-testing]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.
```

### Switching back to a known value
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # lxd_trust_certificate.computed_cert_example must be replaced
-/+ resource "lxd_trust_certificate" "computed_cert_example" {
      ~ content     = (sensitive value)
      ~ fingerprint = "a691286686e42d2815bf933718fc5b35cb3dc9ba1c2f20c2dc71da465974360d" -> "1121b78ef216b434ca94ee3ef47ee62d69d8026fcc8855ee1c1c5519f5f56986" # forces replacement
        name        = "just-testing"
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

lxd_trust_certificate.computed_cert_example: Destroying... [name=just-testing]
lxd_trust_certificate.computed_cert_example: Destruction complete after 0s
lxd_trust_certificate.computed_cert_example: Creating...
lxd_trust_certificate.computed_cert_example: Creation complete after 0s [name=just-testing]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

Follow-up plan confirming no changes to make:
```
tls_private_key.client_key: Refreshing state... [id=187bff4777f0aa3500a9f213ff745c13a4a9abe7]
tls_self_signed_cert.client_cert_two: Refreshing state... [id=317181090428584490246863920778897570130]
tls_self_signed_cert.client_cert: Refreshing state... [id=292612245301452014992727172605085142908]
lxd_trust_certificate.computed_cert_example: Refreshing state... [name=just-testing]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

### Switching from `content` to `file`
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # lxd_trust_certificate.computed_cert_example must be replaced
-/+ resource "lxd_trust_certificate" "computed_cert_example" {
      - content     = (sensitive value) -> null
      ~ fingerprint = "1121b78ef216b434ca94ee3ef47ee62d69d8026fcc8855ee1c1c5519f5f56986" -> "86fdf07a177d967b2e63721d4bfe074a7c4089e600eaa3e2be7d606d670702fd" # forces replacement
        name        = "just-testing"
      + path        = "/home/jsimpso/tmp/cert.pem"
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

lxd_trust_certificate.computed_cert_example: Destroying... [name=just-testing]
lxd_trust_certificate.computed_cert_example: Destruction complete after 0s
lxd_trust_certificate.computed_cert_example: Creating...
lxd_trust_certificate.computed_cert_example: Creation complete after 0s [name=just-testing]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

### Validating fingerprint is still read when new resource is created with `file` input
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # lxd_trust_certificate.computed_cert_example will be created
  + resource "lxd_trust_certificate" "computed_cert_example" {
      + fingerprint = "86fdf07a177d967b2e63721d4bfe074a7c4089e600eaa3e2be7d606d670702fd"
      + name        = "just-testing"
      + path        = "/home/jsimpso/tmp/cert.pem"
      + projects    = []
      + type        = "client"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```